{
  "packageName": "Google Calendar, Task, Reminder, and Gmail Search and Gmail Notification Device",
  "author": "ritchierich",
  "version": "4.5.0",
  "minimumHEVersion": "2.2.5.130",
  "dateReleased": "2023-10-17",
  "documentationLink": "https://github.com/HubitatCommunity/Google_Calendar_Search/blob/main/README.md",
  "communityLink": "https://community.hubitat.com/t/release-google-calendar-search/71397",
  "releaseNotes": "v4.5.0: Added new nextEvent attribute to the child switch to provide details of next events found from calendar searches.  Setting added in the search trigger to define what detail is included.\n- Google deprecated Reminders and migrated this functionality to Tasks.  Removed the reminder code from this app and if you had previously setup a Reminder search it will no longer work and an error will be logged notifying you of that.\n- Refactored the error handling when the hub is having challenges reaching the Google APIs or if they are slow and timeout.  Any existing items found will continue to be processed based on previous gathered data.\nv4.4.4:Fixed NullPointerException when search finds no results from Google.\n- Added error handling for HttpHostConnectException errors (internet outages) where previous found item will continue working throughout outage based on previous gathered details.\nv4.4.3:Fixed NullPointerException error after enabling a child switch on an existing search trigger.\n- Fixed 'bad character in base64 value on line 1184 (method getNextMessages)' error when parsing Gmail emails.\n- Fixed issue when running Rule Machine rules at calendar event end and private boolean not getting set prior to rule actions running again.\nv4.4.2: Fixed a NullPointerException error when searching for Gmail messages\nv4.4.1: Added new 'Include hub's timezone in calendar query' preference that makes the change made in v4.4.0 optional.  Default is disabled.\n- Added setting to toggle the switches controlled by Additional Actions Control switches at the scheduled end of the calendar event.\nv4.4.0: Fixed bug to address situation when hub and target Google Calendar are set to different time zones.\n- Added 'Debug authentication' setting to the parent GCal Search app that controls debug logging of the authentication to the Google APIs since this can contain sensitive information if shared. This defaults to false\n- Child GCal Search Trigger now passes its app label to the parent GCal Search app so you can distinguish debug logging if multiple search triggers are scheduled at the same time\n- If a GCal Search Trigger has a child switch, the Last Refreshed text at the very top will be a clickable link so you can quickly navigate to that child device\n- A new 'Use offset for start and end timestamps' preference was added to the GCal Switch driver that will control whether the eventStartTime and eventEndTime attributes use the offset timestamps versus the actual event timestamps\nv4.3.0: Added ability to parse text from Google items and update Hub variables with those values\nv4.2.0: Fixed issue with sending files via Gmail notification\nv4.1.0: Fixed NullPointerException error in parent GCal Search app, Added the ability to include emoji's within Gmail notification email subjects, Added the ability to specify a from Display Name within Gmail notification messages\nv4.0.0: Re-release of the Gmail Search and Notification Device with new version number.\n- Added ability to dynamically set the recipient and subject of a Gmail notification within the notification message\n- Added the ability to specify a file within the Gmail notification message to be included in the email as an attachment\n- When setting up new Gmail Search triggers, the search string is no longer required\n\nPrior Release notes can be found in this post on the community: https://community.hubitat.com/t/release-google-calendar-task-reminder-and-gmail-search-and-gmail-notification-device/71397/2",
  "apps": [
    {
      "id": "c202eb19-0d1d-44e7-b94c-c7d975a53db9",
      "name": "GCal Search",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Apps/GCal_Search.groovy",
      "required": true,
      "oauth": true,
      "primary": true
    },
    {
      "id": "2cf93482-e02d-4ec8-8f04-2c2f5b5839dd",
      "name": "GCal Search Trigger",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Apps/GCal_Search_Trigger.groovy",
      "required": true,
      "oauth": false,
      "primary": false
    }
  ],
  "drivers": [
    {
      "id": "9cca5110-9112-4857-a19b-f97de72f34ac",
      "name": "GCal Switch",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Driver/GCal_Switch.groovy",
      "required": true
    },
    {
      "id": "fed4b2c4-8021-406f-af5e-c610618a1210",
      "name": "Gmail Notification Device",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Driver/Gmail_Notification_Device.groovy",
      "required": true
    }
  ]
}
