{
  "packageName": "Google Calendar, Task, and Gmail Search and Gmail Notification Device",
  "author": "ritchierich",
  "version": "4.7.1",
  "minimumHEVersion": "2.2.5.130",
  "dateReleased": "2024-09-21",
  "documentationLink": "https://github.com/HubitatCommunity/Google_Calendar_Search/blob/main/README.md",
  "communityLink": "https://community.hubitat.com/t/release-google-calendar-search/71397",
  "releaseNotes": "v4.7.1: Fixed a few bugs from v4.7.0\nv4.7.0: Add new capability to update Hub Variables with attributes from the matching Google Item. This functionality is found in the Search Trigger Additional Actions section.\nv4.6.5: Fixed bug with last release where text wasn't parsed correctly.\nv4.6.4: Enhanced the Additional Actions Text to Parse feature. Previously it would look for text that starts with text entered in the Text Prefix column and set the designated variable to the remaining text. Now it will look for text across the entire line of text and remove the value entered in the Text to Find column and set the designated variable to the remaining text.\nv4.6.3: Fixed issue in Search Triggers where 'Enable descriptionText logging' wasn't available for all Additional Action options\n-Added option to disable toggling of switches at the end of a calendar event when using Additional Action Toggle Switches capability\nv4.6.2: Fixed issue with Additional Actions Control Switches where switches listed were toggling at the event scheduled event even though the setting was set to false\nv4.6.1: Fixed NullPointerException while loading the parent GCal Search app when a Gmail Notification device is disabled\n- Added additional error handling in the upgradeSettings app to prevent errors\nv4.6.0: Added ability to turn on and off other existing switches in the Additional Actions settings. A child switch is no longer required to do so. If this was setup previously, the upgrade process will move the settings to Additional Actions.\n- Added the ability to enter '\n' within a Gmail notification message which will cause a carriage return within the email sent. In recent versions HTML is automatically stripped so this is a work around for new lines within email notifications.\n- When selecting switches in the various Additional Actions settings, the filter box is now available to quickly find specific switches.\nv4.5.1: Fixed NullPointerException error when using Additional Action Notifications\nv4.5.0: Added new nextEvent attribute to the child switch to provide details of next events found from calendar searches.  Setting added in the search trigger to define what detail is included.\n- Google deprecated Reminders and migrated this functionality to Tasks.  Removed the reminder code from this app and if you had previously setup a Reminder search it will no longer work and an error will be logged notifying you of that.\n- Refactored the error handling when the hub is having challenges reaching the Google APIs or if they are slow and timeout.  Any existing items found will continue to be processed based on previous gathered data.\n\nPrior Release notes can be found in this post on the community: https://community.hubitat.com/t/release-google-calendar-task-reminder-and-gmail-search-and-gmail-notification-device/71397/2",
  "apps": [
    {
      "id": "c202eb19-0d1d-44e7-b94c-c7d975a53db9",
      "name": "GCal Search",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Apps/GCal_Search.groovy",
      "required": true,
      "oauth": true,
      "primary": true
    },
    {
      "id": "2cf93482-e02d-4ec8-8f04-2c2f5b5839dd",
      "name": "GCal Search Trigger",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Apps/GCal_Search_Trigger.groovy",
      "required": true,
      "oauth": false,
      "primary": false
    }
  ],
  "drivers": [
    {
      "id": "9cca5110-9112-4857-a19b-f97de72f34ac",
      "name": "GCal Switch",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Driver/GCal_Switch.groovy",
      "required": true
    },
    {
      "id": "fed4b2c4-8021-406f-af5e-c610618a1210",
      "name": "Gmail Notification Device",
      "namespace": "HubitatCommunity",
      "location": "https://raw.githubusercontent.com/HubitatCommunity/Google_Calendar_Search/main/Driver/Gmail_Notification_Device.groovy",
      "required": true
    }
  ]
}
